wisteria-1c/Конфигурация/InformationRegisters/ОбязательностьЗаполненияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОбязательностьЗаполненияРеквизитов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ОбязательностьЗаполненияРеквизитов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ОбязательныеДляЗаполненияРеквизитыОбъекта(Объект) Экспорт
	
	МассивРеквизитов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбязательностьЗаполненияРеквизитов.Реквизит КАК Реквизит
	|ИЗ
	|	РегистрСведений.ОбязательностьЗаполненияРеквизитов КАК ОбязательностьЗаполненияРеквизитов
	|ГДЕ
	|	ОбязательностьЗаполненияРеквизитов.Объект = &Объект
	|	И ОбязательностьЗаполненияРеквизитов.ОбязательноеЗаполнение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивРеквизитов.Добавить(Выборка.Реквизит);
	КонецЦикла;
	
	Возврат МассивРеквизитов;
	
КонецФункции

Функция ОбязательностьЗаполненияРеквизита(Объект, Реквизит) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбязательностьЗаполненияРеквизитов.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение
	|ИЗ
	|	РегистрСведений.ОбязательностьЗаполненияРеквизитов КАК ОбязательностьЗаполненияРеквизитов
	|ГДЕ
	|	ОбязательностьЗаполненияРеквизитов.Объект = &Объект
	|	И ОбязательностьЗаполненияРеквизитов.Реквизит = &Реквизит";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Реквизит", Реквизит);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ОбязательноеЗаполнение;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбъектыДляОбязательногоЗаполненияРеквизита(Реквизит) Экспорт
	
	МассивОбъектов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбязательностьЗаполненияРеквизитов.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ОбязательностьЗаполненияРеквизитов КАК ОбязательностьЗаполненияРеквизитов
	|ГДЕ
	|	ОбязательностьЗаполненияРеквизитов.Реквизит = &Реквизит
	|	И ОбязательностьЗаполненияРеквизитов.ОбязательноеЗаполнение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Реквизит", Реквизит);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивОбъектов.Добавить(Выборка.Объект);
	КонецЦикла;
	
	Возврат МассивОбъектов;
	
КонецФункции

Процедура ПроверитьОбязательноеЗаполнениеИсточникаПривлеченияНаФорме(
	НазваниеОбъекта, ОбъектСФормы, Отказ, НазваниеРеквизита = "ИсточникПривлечения") Экспорт
	
	Если ЗначениеЗаполнено(ОбъектСФормы[НазваниеРеквизита]) Тогда
		Возврат;
	КонецЕсли;
	
	НужноЗаполнять = ОбязательностьЗаполненияРеквизита(НазваниеОбъекта, "ИсточникПривлечения");
	Если Не НужноЗаполнять Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Заполнение", "Источник привлечения");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , СтрШаблон("Объект[%1]", НазваниеРеквизита), , Отказ);
	
КонецПроцедуры

Процедура ПроверитьОбязательноеЗаполнениеИсточникаПривлеченияПриЗаписи(НазваниеОбъекта, МодульОбъекта, Отказ) Экспорт
	
	Если ЗначениеЗаполнено(МодульОбъекта["ИсточникПривлечения"]) Тогда
		Возврат;
	КонецЕсли;
	
	НужноЗаполнять = ОбязательностьЗаполненияРеквизита(НазваниеОбъекта, "ИсточникПривлечения");
	Если Не НужноЗаполнять Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Заполнение", "Источник привлечения");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, МодульОбъекта, "Объект.ИсточникПривлечения", , Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
